@hkantare this is the output for `terraform apply` with `TF_LOG=DEBUG`:
```
2020/06/17 20:07:18 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
2020/06/17 20:07:18 [INFO] Terraform version: 0.12.26  
2020/06/17 20:07:18 [INFO] Go runtime version: go1.12.13
2020/06/17 20:07:18 [INFO] CLI args: []string{"/Users/kwokkeekum/terraform/terraform", "apply"}
2020/06/17 20:07:18 [DEBUG] Attempting to open CLI config file: /Users/kwokkeekum/.terraformrc
2020/06/17 20:07:18 [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2020/06/17 20:07:18 [DEBUG] checking for credentials in "/Users/kwokkeekum/.terraform.d/plugins"
2020/06/17 20:07:18 [INFO] CLI command args: []string{"apply"}
2020/06/17 20:07:18 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
2020/06/17 20:07:18 [DEBUG] New state was assigned lineage "025e31ef-0dd2-f051-7371-dadb00931a63"
2020/06/17 20:07:18 [DEBUG] checking for provider in "."
2020/06/17 20:07:18 [DEBUG] checking for provider in "/Users/kwokkeekum/terraform"
2020/06/17 20:07:18 [DEBUG] checking for provider in ".terraform/plugins/darwin_amd64"
2020/06/17 20:07:18 [DEBUG] checking for provider in "/Users/kwokkeekum/.terraform.d/plugins"
2020/06/17 20:07:18 [DEBUG] found provider "terraform-provider-ibm_v1.7.1"
2020/06/17 20:07:18 [DEBUG] found provider "terraform-provider-ibm_v1.7.1.pem"
2020/06/17 20:07:18 [DEBUG] found provider "terraform-provider-ibm_v1.7.1.sig"
2020/06/17 20:07:18 [DEBUG] found valid plugin: "ibm", "1.7.1", "/Users/kwokkeekum/.terraform.d/plugins/terraform-provider-ibm_v1.7.1"
2020/06/17 20:07:18 [DEBUG] checking for provisioner in "."
2020/06/17 20:07:18 [DEBUG] checking for provisioner in "/Users/kwokkeekum/terraform"
2020/06/17 20:07:18 [DEBUG] checking for provisioner in ".terraform/plugins/darwin_amd64"
2020/06/17 20:07:18 [DEBUG] checking for provisioner in "/Users/kwokkeekum/.terraform.d/plugins"
2020/06/17 20:07:18 [INFO] backend/local: starting Apply operation
2020-06-17T20:07:19.020+1000 [INFO]  plugin: configuring client automatic mTLS
2020-06-17T20:07:19.051+1000 [DEBUG] plugin: starting plugin: path=/Users/kwokkeekum/.terraform.d/plugins/terraform-provider-ibm_v1.7.1 args=[/Users/kwokkeekum/.terraform.d/plugins/terraform-provider-ibm_v1.7.1]
2020-06-17T20:07:19.055+1000 [DEBUG] plugin: plugin started: path=/Users/kwokkeekum/.terraform.d/plugins/terraform-provider-ibm_v1.7.1 pid=14906
2020-06-17T20:07:19.055+1000 [DEBUG] plugin: waiting for RPC address: path=/Users/kwokkeekum/.terraform.d/plugins/terraform-provider-ibm_v1.7.1
2020-06-17T20:07:19.085+1000 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/06/17 20:07:19 IBM Cloud Provider version 1.7.1  
2020-06-17T20:07:19.087+1000 [INFO]  plugin.terraform-provider-ibm_v1.7.1: configuring server automatic mTLS: timestamp=2020-06-17T20:07:19.087+1000
2020-06-17T20:07:19.113+1000 [DEBUG] plugin: using plugin: version=5
2020-06-17T20:07:19.113+1000 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: plugin address: network=unix address=/var/folders/_3/_bch0ndd2db3qrn9kxk2t9l40000gn/T/plugin031394137 timestamp=2020-06-17T20:07:19.113+1000
2020-06-17T20:07:19.169+1000 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unimplemented desc = unknown service plugin.GRPCStdio"
2020-06-17T20:07:19.190+1000 [DEBUG] plugin: plugin process exited: path=/Users/kwokkeekum/.terraform.d/plugins/terraform-provider-ibm_v1.7.1 pid=14906
2020-06-17T20:07:19.190+1000 [DEBUG] plugin: plugin exited
2020/06/17 20:07:19 [INFO] terraform: building graph: GraphTypeValidate
2020/06/17 20:07:19 [DEBUG] ProviderTransformer: "ibm_compute_bare_metal.hourly-bm02" (*terraform.NodeValidatableResource) needs provider.ibm
2020/06/17 20:07:19 [DEBUG] ReferenceTransformer: "ibm_compute_bare_metal.hourly-bm02" references: []
2020/06/17 20:07:19 [DEBUG] ReferenceTransformer: "var.iaas_classic_username" references: []
2020/06/17 20:07:19 [DEBUG] ReferenceTransformer: "var.iaas_classic_api_key" references: []
2020/06/17 20:07:19 [DEBUG] ReferenceTransformer: "var.region" references: []
2020/06/17 20:07:19 [DEBUG] ReferenceTransformer: "var.ibmcloud_api_key" references: []
2020/06/17 20:07:19 [DEBUG] ReferenceTransformer: "provider.ibm" references: [var.ibmcloud_api_key var.iaas_classic_api_key var.region var.iaas_classic_username]
2020/06/17 20:07:19 [DEBUG] Starting graph walk: walkValidate
2020-06-17T20:07:19.200+1000 [INFO]  plugin: configuring client automatic mTLS
2020-06-17T20:07:19.227+1000 [DEBUG] plugin: starting plugin: path=/Users/kwokkeekum/.terraform.d/plugins/terraform-provider-ibm_v1.7.1 args=[/Users/kwokkeekum/.terraform.d/plugins/terraform-provider-ibm_v1.7.1]
2020-06-17T20:07:19.231+1000 [DEBUG] plugin: plugin started: path=/Users/kwokkeekum/.terraform.d/plugins/terraform-provider-ibm_v1.7.1 pid=14907
2020-06-17T20:07:19.231+1000 [DEBUG] plugin: waiting for RPC address: path=/Users/kwokkeekum/.terraform.d/plugins/terraform-provider-ibm_v1.7.1
2020-06-17T20:07:19.265+1000 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/06/17 20:07:19 IBM Cloud Provider version 1.7.1  
2020-06-17T20:07:19.268+1000 [INFO]  plugin.terraform-provider-ibm_v1.7.1: configuring server automatic mTLS: timestamp=2020-06-17T20:07:19.268+1000
2020-06-17T20:07:19.293+1000 [DEBUG] plugin: using plugin: version=5
2020-06-17T20:07:19.293+1000 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: plugin address: address=/var/folders/_3/_bch0ndd2db3qrn9kxk2t9l40000gn/T/plugin212593262 network=unix timestamp=2020-06-17T20:07:19.292+1000
2020-06-17T20:07:19.341+1000 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unimplemented desc = unknown service plugin.GRPCStdio"
2020-06-17T20:07:19.371+1000 [DEBUG] plugin: plugin process exited: path=/Users/kwokkeekum/.terraform.d/plugins/terraform-provider-ibm_v1.7.1 pid=14907
2020-06-17T20:07:19.371+1000 [DEBUG] plugin: plugin exited
2020/06/17 20:07:19 [INFO] backend/local: apply calling Refresh
2020/06/17 20:07:19 [INFO] terraform: building graph: GraphTypeRefresh
2020/06/17 20:07:19 [DEBUG] pruning unused provider.ibm
2020/06/17 20:07:19 [DEBUG] ReferenceTransformer: "var.ibmcloud_api_key" references: []
2020/06/17 20:07:19 [DEBUG] ReferenceTransformer: "var.iaas_classic_username" references: []
2020/06/17 20:07:19 [DEBUG] ReferenceTransformer: "var.iaas_classic_api_key" references: []
2020/06/17 20:07:19 [DEBUG] ReferenceTransformer: "var.region" references: []
2020/06/17 20:07:19 [DEBUG] Starting graph walk: walkRefresh
2020/06/17 20:07:19 [INFO] backend/local: apply calling Plan
2020/06/17 20:07:19 [INFO] terraform: building graph: GraphTypePlan
2020/06/17 20:07:19 [DEBUG] ProviderTransformer: "ibm_compute_bare_metal.hourly-bm02" (*terraform.NodePlannableResource) needs provider.ibm
2020/06/17 20:07:19 [DEBUG] ReferenceTransformer: "ibm_compute_bare_metal.hourly-bm02" references: []
2020/06/17 20:07:19 [DEBUG] ReferenceTransformer: "var.ibmcloud_api_key" references: []
2020/06/17 20:07:19 [DEBUG] ReferenceTransformer: "var.iaas_classic_username" references: []
2020/06/17 20:07:19 [DEBUG] ReferenceTransformer: "var.iaas_classic_api_key" references: []
2020/06/17 20:07:19 [DEBUG] ReferenceTransformer: "var.region" references: []
2020/06/17 20:07:19 [DEBUG] ReferenceTransformer: "provider.ibm" references: [var.iaas_classic_api_key var.ibmcloud_api_key var.iaas_classic_username var.region]
2020/06/17 20:07:19 [DEBUG] Starting graph walk: walkPlan
2020-06-17T20:07:19.373+1000 [INFO]  plugin: configuring client automatic mTLS
2020-06-17T20:07:19.398+1000 [DEBUG] plugin: starting plugin: path=/Users/kwokkeekum/.terraform.d/plugins/terraform-provider-ibm_v1.7.1 args=[/Users/kwokkeekum/.terraform.d/plugins/terraform-provider-ibm_v1.7.1]
2020-06-17T20:07:19.403+1000 [DEBUG] plugin: plugin started: path=/Users/kwokkeekum/.terraform.d/plugins/terraform-provider-ibm_v1.7.1 pid=14908
2020-06-17T20:07:19.403+1000 [DEBUG] plugin: waiting for RPC address: path=/Users/kwokkeekum/.terraform.d/plugins/terraform-provider-ibm_v1.7.1
2020-06-17T20:07:19.437+1000 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/06/17 20:07:19 IBM Cloud Provider version 1.7.1  
2020-06-17T20:07:19.440+1000 [INFO]  plugin.terraform-provider-ibm_v1.7.1: configuring server automatic mTLS: timestamp=2020-06-17T20:07:19.440+1000
2020-06-17T20:07:19.468+1000 [DEBUG] plugin: using plugin: version=5
2020-06-17T20:07:19.468+1000 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: plugin address: address=/var/folders/_3/_bch0ndd2db3qrn9kxk2t9l40000gn/T/plugin733904627 network=unix timestamp=2020-06-17T20:07:19.468+1000
2020-06-17T20:07:19.517+1000 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unimplemented desc = unknown service plugin.GRPCStdio"
2020-06-17T20:07:19.537+1000 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/06/17 20:07:19 Configuring SoftLayer Session with API key
2020-06-17T20:07:19.537+1000 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/06/17 20:07:19 Configuring IBM Cloud Session with API key
2020-06-17T20:07:26.030+1000 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/06/17 20:07:26 the apiendpoint url for power is au-syd.power-iaas.cloud.ibm.com
2020/06/17 20:07:26 [DEBUG] Resource instance state not found for node "ibm_compute_bare_metal.hourly-bm02", instance ibm_compute_bare_metal.hourly-bm02
2020/06/17 20:07:26 [DEBUG] ReferenceTransformer: "ibm_compute_bare_metal.hourly-bm02" references: []
2020/06/17 20:07:26 [WARN] Provider "registry.terraform.io/-/ibm" produced an invalid plan for ibm_compute_bare_metal.hourly-bm02, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .ipv6_static_enabled: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .redundant_network: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .extended_hardware_testing: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .unbonded_network: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .software_guard_extensions: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .ipv6_enabled: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .restricted_network: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .tcp_monitoring: planned value cty.False does not match config value cty.NullVal(cty.Bool)
2020-06-17T20:07:26.045+1000 [DEBUG] plugin: plugin process exited: path=/Users/kwokkeekum/.terraform.d/plugins/terraform-provider-ibm_v1.7.1 pid=14908
2020-06-17T20:07:26.045+1000 [DEBUG] plugin: plugin exited

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ibm_compute_bare_metal.hourly-bm02 will be created
  + resource "ibm_compute_bare_metal" "hourly-bm02" {
      + block_storage_ids         = (known after apply)
      + datacenter                = "syd01"
2020/06/17 20:07:26 [DEBUG] command: asking for input: "Do you want to perform these actions?"
      + domain                    = "KWOK-KEE-KUM-s-Account.cloud"
      + extended_hardware_testing = false
      + file_storage_ids          = (known after apply)
      + fixed_config_preset       = "1U_2174S_64GB_2X4TB_RAID_1"
      + global_identifier         = (known after apply)
      + hostname                  = "hourly-bm02"
      + hourly_billing            = true
      + id                        = (known after apply)
      + ipv6_address              = (known after apply)
      + ipv6_address_id           = (known after apply)
      + ipv6_enabled              = false
      + ipv6_static_enabled       = false
      + memory                    = (known after apply)
      + network_speed             = 1000
      + notes                     = "note test"
      + os_reference_code         = "WIN_2019-STD_64"
      + private_ipv4_address      = (known after apply)
      + private_ipv4_address_id   = (known after apply)
      + private_network_only      = false
      + private_subnet            = (known after apply)
      + private_vlan_id           = (known after apply)
      + public_bandwidth          = (known after apply)
      + public_ipv4_address       = (known after apply)
      + public_ipv4_address_id    = (known after apply)
      + public_subnet             = (known after apply)
      + public_vlan_id            = (known after apply)
      + redundant_network         = false
      + redundant_power_supply    = (known after apply)
      + restricted_network        = false
      + secondary_ip_addresses    = (known after apply)
      + software_guard_extensions = false
      + tags                      = [
          + "collectd",
          + "mesos-master",
        ]
      + tcp_monitoring            = false
      + unbonded_network          = false
      + user_metadata             = jsonencode(
            {
              + value = "newvalue"
            }
        )
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

2020/06/17 20:07:30 [INFO] backend/local: apply calling Apply
2020/06/17 20:07:30 [INFO] terraform: building graph: GraphTypeApply
2020/06/17 20:07:30 [DEBUG] Resource state not found for node "ibm_compute_bare_metal.hourly-bm02", instance ibm_compute_bare_metal.hourly-bm02
2020/06/17 20:07:30 [DEBUG] ProviderTransformer: "ibm_compute_bare_metal.hourly-bm02 (prepare state)" (*terraform.NodeApplyableResource) needs provider.ibm
2020/06/17 20:07:30 [DEBUG] ProviderTransformer: "ibm_compute_bare_metal.hourly-bm02" (*terraform.NodeApplyableResourceInstance) needs provider.ibm
2020/06/17 20:07:30 [DEBUG] ReferenceTransformer: "provider.ibm" references: [var.ibmcloud_api_key var.iaas_classic_username var.iaas_classic_api_key var.region]
2020/06/17 20:07:30 [DEBUG] ReferenceTransformer: "ibm_compute_bare_metal.hourly-bm02 (prepare state)" references: []
2020/06/17 20:07:30 [DEBUG] ReferenceTransformer: "ibm_compute_bare_metal.hourly-bm02" references: []
2020/06/17 20:07:30 [DEBUG] ReferenceTransformer: "var.ibmcloud_api_key" references: []
2020/06/17 20:07:30 [DEBUG] ReferenceTransformer: "var.iaas_classic_username" references: []
2020/06/17 20:07:30 [DEBUG] ReferenceTransformer: "var.iaas_classic_api_key" references: []
2020/06/17 20:07:30 [DEBUG] ReferenceTransformer: "var.region" references: []
2020/06/17 20:07:30 [DEBUG] Starting graph walk: walkApply
2020-06-17T20:07:30.399+1000 [INFO]  plugin: configuring client automatic mTLS
2020-06-17T20:07:30.428+1000 [DEBUG] plugin: starting plugin: path=/Users/kwokkeekum/.terraform.d/plugins/terraform-provider-ibm_v1.7.1 args=[/Users/kwokkeekum/.terraform.d/plugins/terraform-provider-ibm_v1.7.1]
2020-06-17T20:07:30.433+1000 [DEBUG] plugin: plugin started: path=/Users/kwokkeekum/.terraform.d/plugins/terraform-provider-ibm_v1.7.1 pid=14925
2020-06-17T20:07:30.433+1000 [DEBUG] plugin: waiting for RPC address: path=/Users/kwokkeekum/.terraform.d/plugins/terraform-provider-ibm_v1.7.1
2020-06-17T20:07:30.469+1000 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/06/17 20:07:30 IBM Cloud Provider version 1.7.1  
2020-06-17T20:07:30.472+1000 [INFO]  plugin.terraform-provider-ibm_v1.7.1: configuring server automatic mTLS: timestamp=2020-06-17T20:07:30.472+1000
2020-06-17T20:07:30.500+1000 [DEBUG] plugin: using plugin: version=5
2020-06-17T20:07:30.500+1000 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: plugin address: address=/var/folders/_3/_bch0ndd2db3qrn9kxk2t9l40000gn/T/plugin924232240 network=unix timestamp=2020-06-17T20:07:30.500+1000
2020-06-17T20:07:30.549+1000 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unimplemented desc = unknown service plugin.GRPCStdio"
2020-06-17T20:07:30.565+1000 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/06/17 20:07:30 Configuring SoftLayer Session with API key
2020-06-17T20:07:30.565+1000 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/06/17 20:07:30 Configuring IBM Cloud Session with API key
2020-06-17T20:07:40.598+1000 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/06/17 20:07:40 the apiendpoint url for power is au-syd.power-iaas.cloud.ibm.com
2020/06/17 20:07:40 [WARN] Provider "registry.terraform.io/-/ibm" produced an invalid plan for ibm_compute_bare_metal.hourly-bm02, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .ipv6_enabled: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .restricted_network: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .tcp_monitoring: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .redundant_network: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .ipv6_static_enabled: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .extended_hardware_testing: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .unbonded_network: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .software_guard_extensions: planned value cty.False does not match config value cty.NullVal(cty.Bool)
ibm_compute_bare_metal.hourly-bm02: Creating...
2020/06/17 20:07:40 [DEBUG] ibm_compute_bare_metal.hourly-bm02: applying the planned Create change
2020-06-17T20:07:40.607+1000 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/06/17 20:07:40 [DEBUG] setting computed for "block_storage_ids" from ComputedKeys
2020-06-17T20:07:40.607+1000 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/06/17 20:07:40 [DEBUG] setting computed for "secondary_ip_addresses" from ComputedKeys
2020-06-17T20:07:40.607+1000 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/06/17 20:07:40 [DEBUG] setting computed for "file_storage_ids" from ComputedKeys
2020-06-17T20:07:40.624+1000 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/06/17 20:07:40 [DEBUG] Request URL:  POST https://api.softlayer.com/rest/v3/SoftLayer_Hardware/generateOrderTemplate.json
2020-06-17T20:07:40.624+1000 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/06/17 20:07:40 [DEBUG] Parameters:  {"parameters":[{"bareMetalInstanceFlag":1,"datacenter":{"name":"syd01"},"domain":"KWOK-KEE-KUM-s-Account.cloud","fixedConfigurationPreset":{"keyName":"1U_2174S_64GB_2X4TB_RAID_1"},"hostname":"hourly-bm02","hourlyBillingFlag":true,"networkComponents":[{"maxSpeed":1000}],"operatingSystemReferenceCode":"WIN_2019-STD_64","postInstallScriptUri":"","privateNetworkOnlyFlag":false,"userData":[{"value":"{\"value\":\"newvalue\"}"}]}]}
2020-06-17T20:07:42.730+1000 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/06/17 20:07:42 [DEBUG] Status Code:  500
2020-06-17T20:07:42.730+1000 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/06/17 20:07:42 [DEBUG] Response:  {"error":"Unable to exact match an OS with reference code: WIN_2019-STD_64. Available options: WIN_2019-STD_64","code":"SoftLayer_Exception_NotFound"}
2020/06/17 20:07:42 [DEBUG] ibm_compute_bare_metal.hourly-bm02: apply errored, but we're indicating that via the Error pointer rather than returning it: Encountered problem trying to get the bare metal order template: SoftLayer_Exception_NotFound: Unable to exact match an OS with reference code: WIN_2019-STD_64. Available options: WIN_2019-STD_64 (HTTP 500)
2020/06/17 20:07:42 [ERROR] <root>: eval: *terraform.EvalApplyPost, err: Encountered problem trying to get the bare metal order template: SoftLayer_Exception_NotFound: Unable to exact match an OS with reference code: WIN_2019-STD_64. Available options: WIN_2019-STD_64 (HTTP 500)
2020/06/17 20:07:42 [ERROR] <root>: eval: *terraform.EvalSequence, err: Encountered problem trying to get the bare metal order template: SoftLayer_Exception_NotFound: Unable to exact match an OS with reference code: WIN_2019-STD_64. Available options: WIN_2019-STD_64 (HTTP 500)

Error: Encountered problem trying to get the bare metal order template: SoftLayer_Exception_NotFound: Unable to exact match an OS with reference code: WIN_2019-STD_64. Available options: WIN_2019-STD_64 (HTTP 500)

  on main.tf line 1, in resource "ibm_compute_bare_metal" "hourly-bm02":
   1: resource "ibm_compute_bare_metal" "hourly-bm02" {


2020-06-17T20:07:42.752+1000 [DEBUG] plugin: plugin process exited: path=/Users/kwokkeekum/.terraform.d/plugins/terraform-provider-ibm_v1.7.1 pid=14925
2020-06-17T20:07:42.752+1000 [DEBUG] plugin: plugin exited
```